---
kind: method
id: M:Autodesk.Revit.DB.Infrastructure.Alignment.GetHCurveTangentAtStation(System.Double)
source: html/c44e55ca-0303-73c3-338c-c08465f86148.htm
---
# Autodesk.Revit.DB.Infrastructure.Alignment.GetHCurveTangentAtStation Method

Calculate 2d (X and Y components of returned vector) horizontal tangent at given station.

## Syntax (C#)
```csharp
public XYZ GetHCurveTangentAtStation(
	double station
)
```

## Parameters
- **station** (`System.Double`) - Alignment station to calculate 2d horizontal tangent for, in Revit internal model units (standard Imperial feet).

## Returns
2d (X and Y components of returned vector) horizontal tangent at given station.